---
kind: method
id: M:Autodesk.Revit.DB.ViewScheduleExportOptions.#ctor
source: html/230d391c-da7e-784d-b8d2-0ee4a306fafa.htm
---
# Autodesk.Revit.DB.ViewScheduleExportOptions.#ctor Method

Constructs a new instance of the ViewScheduleExportOptions class

## Syntax (C#)
```csharp
public ViewScheduleExportOptions()
```